In [6]:
import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york", "chicago", "orlando", "baltimore"],
    "temperature": ["40", "30", "60", "35"]
})
df1

        city temperature
0   new york          40
1    chicago          30
2    orlando          60
3  baltimore          35

In [3]:
import pandas as pd
df2 = pd.DataFrame({
    "city": ["new york", "chicago", "san francisco"],
    "humidity": ["10", "20", "30"]
})
df2

            city humidity
0       new york       10
1        chicago       20
2  san francisco       30

In [11]:
df3=pd.merge(df1,df2,on="city", how="outer", indicator=True)
df3

            city temperature humidity      _merge
0       new york          40       10        both
1        chicago          30       20        both
2        orlando          60      NaN   left_only
3      baltimore          35      NaN   left_only
4  san francisco         NaN       30  right_only

In [12]:
df1 = pd.DataFrame({
    "city": ["new york", "chicago", "orlando", "baltimore"],
    "temperature": ["40", "30", "60", "35"]
})
df1

        city temperature
0   new york          40
1    chicago          30
2    orlando          60
3  baltimore          35